GetTransform Method
 Gets the transform of the instance.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public Transform GetTransform()
  Visual Basic
Public Function GetTransform As Transform
  Visual C++
public:
Transform^ GetTransform()
 Return Value
 The inherent transform.
 See Also
  Instance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →